cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'blackfireio/homebrew-blackfire'
tap 'homebrew/cask-fonts'
tap 'shivammathur/php'

# Install Dropbox so we can sync right away
cask 'dropbox'

# Install Warp so we can get out of this plain terminal
cask 'warp'

brew 'coreutils'
brew 'ack'
brew 'go'
brew 'grc'
brew 'node'
brew 'nvm'
brew 'readline'
brew 'wget'
brew 'yarn'
brew 'nmap'
brew 'youtube-dl'
brew 'tree'
brew 'mas'
brew 'pkg-config'
brew 'imagemagick'
brew 'composer'
brew 'mailhog'
brew 'watchman'
brew 'gh'
brew 'fd'
brew 'bat'
brew 'jq'
brew 'watchman'
brew 'react-native-cli'
brew 'mackup'
brew 'antigen'
brew 'serverless'
brew 'awscli'

cask 'tailscale'
cask 'docker'
cask 'zoom'
cask '1password'
cask 'bettertouchtool'
cask 'karabiner-elements'
cask 'spotify'
cask 'sublime-text'
cask 'slack'
cask 'phpstorm'
cask 'dbngin'
cask 'tableplus'
cask 'whatsapp'
cask 'telegram'
cask 'sip'
cask 'google-chrome'
cask 'font-fira-code'
cask 'visual-studio-code'
cask 'notion'
cask 'runjs'
cask 'sourcetree'
cask 'finicky'
cask 'raycast'
cask 'mimestream'

# Gaming
cask 'nvidia-geforce-now'
cask 'steam'

# App Store applications
mas "Save to Raindrop", id: 1549370672
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
mas "NextDNS", id: 1464122853
